#Для начала предлаегаем пользователю зарегистрироваться
start = print("Пожалуйста введите свои данные:")
name = input("Ваше Имя: ")
first_name = input("Ваша Фамилия: ")
age = int(input("Сколько Вам лет?: "))
if age < 18:
    print("Извините, Вам нет 18, Вы не можете продолжить участие в розыгрыше")
    exit()
else:
    print(name + ", " + "Спасибо за регистрацию!")

priz = input("Вы добавлены в розыгрыш, введите слово старт для запуска: ")
if priz == "старт":
    print("Ура! Мы начали игру!")
else:
    input("Извините, не понимаю Вас, для продолжения игры, пожалуйста, введите слово (старт): ")
    print("Ура! Мы начали игру!")

#После регистрации и стрта предлагаем ввести любое число от 1 до 30, в противном случае, попросим ввести корректное число

import random
while True:
        number = int(input("Пожалуйста, введите любое число от 1 до 30: "))
        if number < 1 or number > 30:
            input("Вы ввели число, которое не участвует в розыгрыше, пожалуйста, введите корректное число: ")
        random_number = random.randint(1, 30)
        print("Случайное число: " + str(random_number))
        if random_number == number:
            print("Поздравляем, вы угадали!")
        else:
            print("Ой, похоже, что у вас проигрыш, но не расстраивайтесь, в следующий раз обязательно повезет!")
        answer = input("Хотите попробовать еще раз? (да/нет): ")
        if answer == "да":
            continue
        elif answer == "нет":
            print("Было приятно поиграть с Вами, до встречи!")
            break
        else:
            input("Извините, не понимаю вас, введите ответ: (да/нет): ")







